
"use strict";    //суворий режим коду...


//.length //властивісьть рядка., показує кількість символів.

// сутність.ім`я_метода()
//.toUpperCase()  //метод рядка.. переводить всі символи в верхній регістр..

undefined  // невизначенна змінна...

/* Типи данних :
* string    'string', "string";
* number     7, 21,55;
* boolean    true, false;     імена змінних, що містять буль ставлять запитання, і відповідь на нього - так або ні.;
* null        особливе значення, яке по суті означає ніщо;
* undefined   значення коли змінна оголошується, але не ініціалізується, її значення не визначено, їй присвоюється undefined.  (let username;)
*/
typeof //Оператор що використовується для отримання типу значення змінної. console.log(typeof "message"); // "string"

    
    /*
    --------- Виведення данних -------
    console.log()  - виведення данних в консоль;
    alert()   - виводить модальне вікно;

    --------- Введення данних-----------
    confirm() - виводить модальне вікно з повідомленням, і дві кнопки, Ok і Cancel;     const isComing = confirm("Please confirm hotel reservation");
    prompt() - виводить модальне вікно з полем введення і кнопками Ok і Cancel;     const value = prompt("Please enter a number!");
    */
    
    // Number(val) - приведення значення до числа;
    // NaN (Not a Number) - коли значення привести до числа неможливо;

    Number.parseInt() // парсить з рядка ціле число.   console.log(Number.parseInt("12.46qwe79")); // 12;
    Number.parseFloat() //парсить з рядка дробове число.   console.log(Number.parseFloat("12.46qwe79")); // 12.46;
/* Number.isNaN(val)  //для перевірки на число;
toFixed()  //результат скоротити до певного знаку після коми.    console.log((0.17 + 0.24).toFixed(2)); // 0.41  */
    

Math
/*
Math.floor(num) - повертає найменше ціле число. console.log(Math.floor(1.7)); // 1
Math.ceil(num) - повертає найбільше ціле число. console.log(Math.ceil(1.2)); // 2
Math.round(num) - повертає значення числа округленого до найближчого цілого. console.log(Math.round(1.2)); // 1
Math.max(num1, num2, ...) - повертає найбільше ціле число з набору. console.log(Math.max(20, 10, 50, 40)); // 50
Math.min(num1, num2, ...) - повертає найменше ціле число з набору. console.log(Math.min(20, 10, 50, 40)); // 10
Math.pow(base, exponent) - піднесення до степеня. console.log(Math.pow(2, 4)); // 16
Math.random() - повертає псевдовипадкове число в діапазоні [0, 1). console.log(Math.random()); // випадкове число між 0 і 1
*/

// Властивості і методи рядків

length //довжина рядка.  console.log("Welcome to Bahamas!".length); // 19
.toUpperCase()  //метод рядка.. переводить всі символи в верхній регістр..
    .toLowerCase()  //метод рядка.. переводить всі символи в нижній регістр..
    .indexOf()  //Повертає позицію (індекс), на якій знаходиться перший збіг підрядка або -1, якщо нічого не знайдено.
.includes()  //Перевіряє, чи міститься підрядок в рядку, повертає буль - true або false;
    .endsWith()  //Дозволяє визначити, чи завершується рядок символами (підрядком), зазначеними в дужках, повертаючи true або false.
.replace() //Повертає новий рядок, в якому перше (replace) або усі збіги (replaceAll) підрядка замінені на вказане значення.
.replaceAll()
slice()
.slice ()  //Метод рядків slice (startIndex, endIndex) використовується для створення копії частини або всього рядка. Він робить копію елементів рядка від startIndex і до, але не включно endIndex і повертає новий рядок, не змінюючи оригінал.

/*
 6 хибних (falsy) значень, що приводяться до false у логічному перетворенні: 0, NaN, null, undefined, порожній рядок і false. Абсолютно все інше приводиться до true.*/