// ----------------Отримання даннних від користувача ------------------ 39 хв 1 відоса
// підтвердження
//------------------------------  confirm()  --------------------
const paymentsRenew = confirm('продовжити підписку ?');
console.log(paymentsRenew);
// повертає true або false---------------



// введення мінімальних данних
// -----------------------------  prompt()  --------------------
let quantity = prompt('Введіть кількість товарів...');
// повертає Рядок --- string ---
// --перетворює на числовий тип данних------
quantity = Number(quantity);
// -------------------------------
console.log(quantity);
console.log(typeof quantity);
// --------------------------------------------------------------------



// Робота з інтерфейсом ------------- відос 2 --- 1.44 хв