 
//  ======  Свіч використовується тільки у випадку строгої рівності =======



 /* напиши скрипт вибору вартості готелю по кіль - сті зірок.
1 - 20$, 2 - 30$, 3 - 50$, 4 - 70$, 5 - 120$

Якщо в змінній stars щось окрім чисел 1-5, виведи рядок
"Такої кількості зірок немає"
*/
// let stars = prompt("Напиши скільки зірок ...");
// stars = Number(stars);
// // const stars = 1;
// let price;

// if (stars === 1) {
//     price = "20$";
// } else if (stars === 2) {
//     price = "30$";
// } else if (stars === 3) {
//     price = "50$";
// } else if (stars === 4) {
//     price = "70$";
// } else if (stars === 5) {
//     price = "120$";
// } else {
//     price = "Такої кількості зірок немає";
// };

// switch (stars) {
//     case 1:
//         price = "20$";
//         break;
    
//     case 2:
//         price = "30$";
//         break;
    
//     case 3:
//         price = "50$";
//         break;
    
//     case 4:
//         price = "70$";
//         break;
    
//     case 5:
//         price = "120$";
//         break;
    
//     default:
//         console.log("Такої кількості зірок немає")
// }

// console.log(price);

// ----------------------------------------------------------------------------------------------------------------

/* напиши скрипт вибору вартості готелю по кіль - сті зірок.
1,2 - 20$, 3,4 - 30$, 5 - 120$

Якщо в змінній stars щось окрім чисел 1-5, виведи рядок
"Такої кількості зірок немає"
*/

// let stars = prompt("Напиши скільки зірок ...");
// stars = Number(stars);
// // const stars = 1;
// let price;

// if (stars === 1 || stars === 2) {
//     price = "20$";
// } else if (stars === 3 || stars === 4) {
//     price = "30$";
// } else if (stars === 5) {
//     price = "120$";
// } else {
//     price = "Такої кількості зірок немає";
// };


// ------ Групування кейсів -----

// switch (stars) {
//     case 1:
//         case 2:
//         price = "20$";
//         break;
    
//     case 3:
//         case 4:
//         price = "50$";
//         break;
    
//     case 5:
//         price = "120$";
//         break;
    
//     default:
//         console.log("Такої кількості зірок немає")
// }


// console.log(price);


// -------------------Задачка --------------------
/* Напиши скрипт вибору опцій доставки товара. Опція зберігається в змінній option: 1 - самовивоз, 2 - курєр, 3 - почта.

В змінну message записати повідомлення в залежності від опцій.
"ви зможете забрати товар завтра в офісі"
"курєр доставить завтра о 13.00"
"посилка буде відправлення сьогодні"
"вам перезвонить менеджер"
*/

// 1 створити змінну

const option = 5;
let message = "";

// 2 зробити свіч 1,2,3

switch (option) {
    case 1:
        message = "ви зможете забрати товар завтра в офісі";
        break;
    case 2:
        message = "курєр доставить завтра о 13.00";
        break;
    case 3:
        message = "посилка буде відправлення сьогодні";
        break;
    default:
        console.log("вам перезвонить менеджер")
}


// 3 і в кожному кейсі записати повідомлення...

// зробити .log(message);

console.log(message);