
Anna
  14 д. назад
// Потрібно написати функцію, яка приймає 1 параметр key і буде перевіряти
// чи має об'єкт  такий ключ - поверне true, інакше false
// const obj = {
//   name: 'Jhon',
//   car:  'Audi',
//   carColor: 'White'
// }


Anna
  14 д. назад
// Напишіть функцію для перевірки об'єкта,
// Чи є елемент простим об'єктом,
// чи масивом, null.


Anna
  14 д. назад
// Створіть функцію multiplyNumeric(obj),
//   яка множить всі числові властивості об'єкта obj на 2.
// до  виклику функції
// let menu = {
//   width: 200,
//   height: 300,
//   title: "My menu"
// };
//
// multiplyNumeric(menu);
// після виклику функції
// menu = {
//   width: 400,
//   height: 600,
//   title: "My menu"
// };


Anna
  14 д. назад
//У нас є об'єкт, в якому зберігаються зарплати
//нашої команди
//Напишіть код для обчислення суми всіх зарплат і
//збережіть його результат у змінній sum.
//Якщо об'єкт salaries порожній, то результат має бути 0
// const salaries = {
//   Mango: 570,
//   Poly: 900,
//   Ajax: 1470,
// };


Anna
  14 д. назад
//Напишіть функцію calcTotalPrice(stones, stonesName),
//яка приймає масив об'єктів і
//рядок з назвою каменю.
//Функція повертає загальну вартість каміння
//з таким ім'ям
// const stones = [
//   { name: "Emerald", price: 1300, quantity: 4 },
//   { name: "Diamond", price: 2700, quantity: 6 },
//   { name: "Sapphire", price: 400, quantity: 7 },
//   { name: "Rubble", price: 150, quantity: 100 },
// ];


Anna
  14 д. назад
// Напишіть функцію sumInput(), яка:
// Просить користувача ввести значення, використовуючи prompt та зберігає їх у масив.
// Закінчує запитувати значення, коли користувач введе не числове значення, порожній рядок або натисне «Скасувати».
// Підраховує та повертає суму елементів масиву.
//  P.S. Нуль 0 – вважається числом, не зупиняйте введення значень під час введення «0».


Anna
  14 д. назад
// Напишіть код, щоб видалити всі елементи в заданому масиві
// Функція `deleteElement()` видаляє всі входження елемента із заданого масиву.
// let arr = [23,56,4,78,5,63,45,210,56];
// arr = deleteElement(arr, 56)
// console.log(arr); //[23, 4, 78, 5, 63, 45, 210]


Anna
  14 д. назад
// Напишіть метод, який розбиває масив на частини визначеного розміру
// const data = [1, 2, 3, 4, 5, 6, 7];
// console.log(chunkArray(data, 2)) // [[1, 2], [3, 4], [5, 6], [7]]
// console.log(chunkArray(data, 3)) // [[1, 2, 3], [4, 5, 6], [7]]


Anna
  14 д. назад
/ Напишіть функцію для об’єднання необмежених масивів
// Функція addArrays() повертає об’єднаний масив шляхом поєднання всіх масивів, переданих як аргумент функції.
// console.log(addArrays([2,3,4],[6,4,9],[34,6,4]))
// [2, 3, 4, 6, 4, 9, 34, 6, 4]


Anna
  14 д. назад
// Залишити унікальні елементи масиву
// Нехай arr – масив рядків.
// Напишіть функцію unique(arr), яка повертає масив, що містить лише унікальні елементи arr.
// function unique(arr) {
//   /* ваший код */
// }
//
// let strings = ["торт", "тортик", "кекс", "сир",
//   "бутерброд", "сир", "шоколад", "кекс", "масло", "олія", "торт"
// ];